Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour)
Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: The polygonal contour to add to geometry.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.Contour,System.Double)
Appends a polygon section to this ConnectiveGeometry, using the specified radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
polygon: the polygonal contour to add to this geometry
radius: the specified radius for the connecting cylindrical section
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment)
Appends a polygon section to this ConnectiveGeometry, using the specified connection points and maximal radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: the two connection points on this instance geometry
polygon: the polygonal contour to add to this geometry
segment2: the two connection points on polygon geometry
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.Contour,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Appends a polygon section to this ConnectiveGeometry, using the specified connection points and radius for the cylindrical connection.
geometry: ConnectiveGeometry used to create a connection with.
segment1: the two connection points on this instance geometry
polygon: the polygonal contour to add to this geometry
segment2: the two connection points on polygon geometry
radius: the specified radius for the connecting cylindrical section
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create or modify ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.RemoveLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection)
Removes a polygon section which is the end section, from this ConnectiveGeometry including extensions and cylindrical surface.
geometry: ConnectiveGeometry used to remove a connection.
legSection: Leg GeometrySection to remove.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws System.ArgumentException: Thrown when the supplied legSection is invalid leg section.

Tekla.Structures.Model.BentPlateGeometrySolver.Split(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection)
Returns the resulting geometry or geometries when a section and the related automatically created sections are removed from this geometry.
geometry: ConnectiveGeometry used for split operation.
geometrySection: GeometrySection to remove.
Returns: The resulting geometries once the section and related automatic sections are removed.
Throws System.ArgumentException: Thrown when the supplied geometrySection is invalid.

Tekla.Structures.Model.BentPlateGeometrySolver.ModifyCylindricalSurface(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.CylindricalSurface)
Modifies the shape of a cylindrical surface section, and updates related polygon sections accordingly.
geometry: Reference geometry to modify which contains cylindricalSection.
cylindricalSection: Geometry section to modify.
surface: The modified cylindrical surface for the section.
Returns: Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify cylindrical surface.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry)
Joins another ConnectiveGeometry to this instance, using the maximum radius for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
geometryToAdd: the geometry instance to be joined to this
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.

Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment)
Joins another ConnectiveGeometry to this instance, using the specified connection points for the cylindrical connection.
originalGeometry: ConnectiveGeometry used to create a connection with.
segment1: The two connection points on this instance geometry.
geometryToAdd: The geometry instance to be joined to this one.
segment2: The two connection points on polygon geometry.
Returns: Modified ConnectiveGeometry if command succeeded or originalGeometry otherwise.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.